# TODO: linux

if OS.mac?
    brew "asdf"
    brew "bats-core"
    brew "direnv"
    brew "fzf"
    brew "gcc"
    brew "gh"
    brew "git"
    brew "htop"
    brew "jq"
    brew "make"
    brew "nmap"
    brew "openssh"
    brew "pandoc"
    brew "pkgconf"
    brew "pstree"
    brew "ripgrep"
    brew "tmux"
    brew "tree"
    brew "uv"
    brew "vim"
    brew "yq"
    brew "zlib"
    brew "libtool"

    cask "alacritty"
    cask "betterdisplay"
    cask "gcloud-cli"
end
